In [4]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt

In [5]:
data = pd.read_csv('sealing.csv')

In [6]:
data

      country  age  selary purchased
0  Bangladesh   44   90000       yes
1      France   24   80000        no
2     Germany   32   70000       yes
3  Bangladesh   30   60000        no
4      France   35   50000       yes
5     Germany   50   74000        no
6  Bangladesh   45   40000       yes
7      France   21   30000        no
8     Germany   20   36000       yea

In [7]:
x = data.iloc[:,1:3]

In [8]:
x

   age  selary
0   44   90000
1   24   80000
2   32   70000
3   30   60000
4   35   50000
5   50   74000
6   45   40000
7   21   30000
8   20   36000

In [9]:
from sklearn.preprocessing import MinMaxScaler

In [10]:
MM = MinMaxScaler()

In [11]:
temp = MM.fit_transform(x)

In [12]:
temp

array([[0.8       , 1.        ],
       [0.13333333, 0.83333333],
       [0.4       , 0.66666667],
       [0.33333333, 0.5       ],
       [0.5       , 0.33333333],
       [1.        , 0.73333333],
       [0.83333333, 0.16666667],
       [0.03333333, 0.        ],
       [0.        , 0.1       ]])

In [13]:
from sklearn.preprocessing import StandardScaler

In [16]:
person =  StandardScaler()

In [17]:
him = person.fit_transform(x)

In [18]:
him

array([[ 1.021919  ,  1.56407497],
       [-0.91434858,  1.06133659],
       [-0.13984155,  0.5585982 ],
       [-0.33346831,  0.05585982],
       [ 0.15059859, -0.44687856],
       [ 1.60279928,  0.75969356],
       [ 1.11873238, -0.94961694],
       [-1.20478872, -1.45235533],
       [-1.3016021 , -1.1507123 ]])